app/Controllers/ArvoreController.php

SELECT *
FROM `arvores`
---
    public function index()
    {
        $model = new ArvoreModel();
        $data['arvores'] = $model->findAll();

INSERT INTO `arvores` (`nome_rua`, `tipo_arvore`, `descricao`, `data_corte`, `data_plantio`) VALUES ('b', 'aroeira', 'casa', NULL, '1999-02-09')
---
    public function store()
    {
        $model = new ArvoreModel();

        $data = [
            'nome_rua' => $this->request->getPost('nome_rua'),
            'tipo_arvore' => $this->request->getPost('tipo_arvore'),
            'descricao' => $this->request->getPost('descricao'),
            'data_corte' => $this->request->getPost('data_corte'),
            'data_plantio' => $this->request->getPost('data_plantio'),
        ];

        $model->insert($data);

SELECT *
FROM `arvores`
WHERE `arvores`.`id` = '8'
---
    public function edit($id = null)
    {
        $model = new ArvoreModel();
        $data['arvore'] = $model->find($id);

DELETE FROM `arvores`
WHERE `id` IN ('2')
---
    public function delete($id = null)
    {
        $model = new ArvoreModel();
        $model->delete($id);